app/controllers/api/v1/asks_controller.rb

  def create
    unless request.POST.include? "question"
      puts "Please ask a question"
    end

    ask_service = Services::AskService.new(request.POST[:question])

    previous_question =  Question.find_by(question: ask_service.question)
    if previous_question.present?
      previous_question.ask_count = previous_question.ask_count.to_i + 1
      previous_question.save
      render json: {"question": previous_question.question, "answer": previous_question.answer, "id": previous_question.id}
    else
      answer, context = ask_service.find_answer
      question = Question.new(:question => ask_service.question, :answer => answer, :context => context)
      question.save
---
SELECT "questions".* FROM "questions" WHERE "questions"."question" = ? LIMIT ?  [["question", "What is this?"], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."question" = ? LIMIT ?  [["question", "fsdfsdf?"], ["LIMIT", 1]]
UPDATE "questions" SET "ask_count" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["ask_count", 1], ["updated_at", "2023-11-26 07:00:40.365813"], ["id", 6]]
INSERT INTO "questions" ("question", "context", "answer", "ask_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
UPDATE "questions" SET "ask_count" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["ask_count", 1], ["updated_at", "2023-11-26 16:41:39.004032"], ["id", 7]]