app/controllers/api/v1/questions_controller.rb

  def index
    @questions = Question.order(created_at: :desc)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("question", "context", "answer", "ask_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["question", "MyString"], ["context", "MyText"], ["answer", "MyText"], ["ask_count", 1], ["created_at", "2023-11-24 10:21:36.648797"], ["updated_at", "2023-11-24 10:21:36.648797"]]

  def destroy
    @question.destroy!
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 980190962]]